from datetime import datetime
import inspect
import random
# ==================================================================================================================================================================
# Класс "LocalLogCollector" (сокращенно LLC)
# При создании генерирует рандомный ID сиссии, далее собирает локальную коллекцию логов. Каждый элемент которой представляет собой данные об:
# 1) Время события
# 2) Рандомный ID сессии в виде ХХХХ-ХХХХ-ХХХХ-ХХХХ (где Х рандомная цифра 0-9)
# 3) Тип события (по умолчанию 'info)
# 4) Сообщение
# 5) Название функции-отправителя лога
# 6) Название модуля-отправителя лога
# После сбора коллекции её необходимо отправить на сервер. Если этого не сделать - логи будут потеряны
# Автоматически отправляет логи на сервер в том случае, если в коллекции собирается 1000+ событий
# ==================================================================================================================================================================
class LocalLogCollector(object):
    # **************************************************************************************************************************************************************
    """Класс для локальной агрегации логов работы скрипта и последующем экспорте логов на сервер"""
    def __init__(self):
        """Инициализация класса"""
        self.logs_collection = []
        self.SessionID = str(random.random())[2:6]+'-'+str(random.random())[2:6]+'-'+str(random.random())[2:6]
    # **************************************************************************************************************************************************************
    def addlog(self, msg_text='', msg_type='info'):
        """Добавление лога в коллекцию"""
        try:
            current_frame = inspect.currentframe()
            caller_frame = current_frame.f_back
            code_obj = caller_frame.f_code
            function_name = code_obj.co_name  
            lib_name = code_obj.co_filename.split('\\')[-1]
            msg_id = self.SessionID
            self.logs_collection.append(
                {
                'id': msg_id,
                'message': msg_text,
                'type': msg_type,
                'date': str(datetime.now())[0:19],
                'lib_name': lib_name,
                'function_name': function_name
                })
            val = '[' + msg_type + '] ' + msg_text
            if type(val) != str: val = str(val)
            if self.SessionID != 0: val = '[ID:' + str(self.SessionID) + '] ' + val
            print('[' + str(datetime.now())[0:19].replace('-','.') + '] ' + val + ' (function_name="' + function_name + '",lib_name="' + lib_name + '")')
        except Exception as ex:
            print(str(ex))
    # **************************************************************************************************************************************************************
    def export(self):
        """Экспорт локальных логов на сервер логирования"""
        try:
            pass
        except Exception as ex:
            print(str(ex))
# ==================================================================================================================================================================
