from discord.ext import commands
from discord.ext.commands import errors
from colors import color
import discord
# ==================================================================================================================================================================
class errors(commands.Cog):
    # **************************************************************************************************************************************************************
    def __init__(self,bot):
        self.bot = bot
        self.LLC = bot.LLC
        self.mysql = bot.mysql
    # **************************************************************************************************************************************************************
    @commands.Cog.listener()
    async def on_command_error(self,ctx, err):
        try:
            guild = ctx.guild
            member = ctx.author
            #************************************************************************************************************************************************
            if type(err) == discord.ext.commands.errors.CommandNotFound:
                command_name = str(ctx.message.content).split(' ')[0].lower()
                msg_text = f"Команда __**{command_name}**__ не существует\nМожет быть в названии команды опечатка?"
                self.LLC.addlog(f'Введена некорректная команда "{command_name}" [сервер: "{guild.name}", пользователь: "{member.name}"]')
            #************************************************************************************************************************************************
            elif type(err) == discord.ext.commands.errors.BotMissingPermissions:
                msg_text = f"У бота отсутствуют права: {' '.join(err.missing_perms)}\nВыдайте их ему для полного функционирования бота"
            #************************************************************************************************************************************************
            elif type(err) == discord.ext.commands.errors.MissingPermissions:
                msg_text=f"У вас недостаточно прав для запуска этой команды!"
            #************************************************************************************************************************************************
            elif type(err) == discord.ext.commands.errors.UserInputError:
                msg_text=f"Правильное использование команды {ctx.command}({ctx.command.brief}): `{ctx.command.usage}`"
            #************************************************************************************************************************************************
            elif type(err) == discord.ext.commands.errors.CommandOnCooldown:
                msg_text=f"У вас еще не прошел кулдаун на команду {ctx.command}!\nПодождите еще {err.retry_after:.2f}"
            #************************************************************************************************************************************************
            elif type(err) == discord.ext.commands.errors.MissingAnyRole:
                msg_text=f"Для запуска команды **{self.bot.prefix}{ctx.command.aliases[0]}** необходимо обладать ролью: **{'**, **'.join(err.missing_roles)}**"
            #************************************************************************************************************************************************
            else:
                msg_text=f"Произошла неизвестная ошибка:\n[*{err}*]\nПожалуйста, свяжитесь с разработчиками для исправления этой ошибки"
            #************************************************************************************************************************************************
            embed=discord.Embed(color=color['red'])
            embed.add_field(name=f':x: Ошибка', value=msg_text, inline=False)
            await ctx.send(embed=embed)
        except Exception as error:
            self.LLC.adderrorlog()
# ==================================================================================================================================================================
def setup(bot):
    bot.add_cog(errors(bot))